/************************************************************************/
/** 
* 题目：整数反转
* 给出一个 32 位的有符号整数，你需要将这个整数中每位上的数字进行反转。
*
* 示例 1:
* 输入: 123
* 输出: 321
* 
* 示例 2:
* 输入: -123
* 输出: -321
* 
* 示例 3:
* 输入: 120
* 输出: 21
*
* 注意
* 假设我们的环境只能存储得下 32 位的有符号整数，则其数值范围为 [−2^31,  2^31 − 1]。请根据这个假设，如果反转后整数溢出那么就返回 0
*/
/************************************************************************/
#pragma once

#include "CommonHeader.h"

namespace Solution 
{
	// 1.将整数x转换为字符串str
	// 2.将字符串反转
	// 3.将字符串转化为数字
	int reverseInt(int x) 
	{
		return 0;
	}
};